man
woman
playing
person
cat
dog
an
two
girl
boy
cutting
dancing
riding
slicing
water
guitar
baby
lady
cooking
men
eating
walking
horse
women
car
doing
running
something
bowl
food
pan
ball
people
making
talking
meat
small
singing
knife
piano
one
potato
young
being
onion
putting
plays
eggs
bread
sitting
chicken
little
stage
flute
chopping
rice
monkey
pieces
peeling
fish
paper
chef
pouring
girls
puppy
make
pot
preparing
bike
trying
egg
phone
piece
shooting
slices
animal
jumping
hair
road
cuts
guy
cut
using
floor
group
kitten
performing
carrot
fighting
taking
mixing
gun
showing
boys
video
motorcycle
ground
three
vegetables
white
drinking
butter
holding
dance
driving
dough
music
large
soccer
garlic
puts
toy
moving
song
standing
looking
dish
frying
cook
grass
adding
child
hand
box
vegetable
stirring
swimming
pool
watching
kichen
keyboard
street
kid
bicycle
tomato
green
played
sliced
jumps
rope
flying
finger
oil
onions
across
cleaning
sauce
front
face
beach
plane
field
pizza
rides
bear
head
bag
shrimp
camera
panda
hands
band
board
tree
ingredients
dogs
kids
runs
going
lion
plastic
pours
laughing
cucumber
funny
potatoes
put
children
licking
drums
bird
table
apple
player
top
tiger
room
bed
basketball
play
game
cake
broccoli
cheese
wall
reading
football
climbing
tail
plate
walks
elephant
chair
container
seasoning
speaking
snow
pineapple
mouth
kissing
makeup
kangaroo
stick
house
flour
milk
boat
red
bottle
air
mirror
sword
skillet
wood
frog
old
instrument
giving
shot
outside
puppies
pushing
black
washing
glass
falling
along
stairs
dicing
boiling
show
race
pepper
poured
liquid
rabbit
fire
beef
tricks
lifting
getting
cup
horses
carrying
chili
chopped
couple
kitchen
machine
open
cooked
wooden
falls
target
chops
applying
breaking
window
pulling
cute
polar
fence
carrots
forest
skateboard
lying
bubble
tv
hitting
movie
snake
get
airplane
placing
microphone
computer
recipe
added
rolling
jumped
racing
removing
hit
firing
makes
skin
leaves
mixture
sky
cow
boxing
watermelon
pork
pasta
stunt
japanese
fat
clip
jet
cage
news
bath
exercise
violin
blowing
track
big
cracking
pencil
animals
throwing
sort
zebras
kicking
train
biting
jump
deer
loris
goal
shoots
crying
beating
writing
enjoying
exercising
basket
opening
cricket
stunts
ride
hamster
couch
feeding
tomatoes
made
door
tofu
soup
sea
coking
sofa
badger
takes
salad
boiled
telephone
cats
drawing
sleeping
filling
hill
wearing
tub
ceiling
slice
typing
indian
seated
peeled
barking
dead
oven
short
store
four
rain
scooter
eats
catch
laptop
electric
cycle
weights
toddler
seeds
dirt
eat
spreading
skating
laying
peels
dances
fox
away
bus
persons
squirrel
paws
smoking
